WheelerLee/esp32-ai-agent/components/LCD/lcd.c
#include "lcd.h"

#include <stdbool.h>
#include <stddef.h>

#include "driver/spi_master.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_idf_version.h"
#include "esp_lcd_ili9341.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_touch.h"
#include "esp_lcd_touch_xpt2046.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lvgl.h"

static const char *TAG = "lcd";

LV_FONT_DECLARE(lv_font_chinese_16);

static esp_lcd_panel_handle_t s_panel_handle;
static lv_disp_draw_buf_t s_disp_buf;
static lv_disp_drv_t s_disp_drv;
static lv_indev_drv_t s_indev_drv;
static lv_obj_t *s_text_label;
static lv_obj_t *s_button;
static esp_lcd_touch_handle_t s_touch_handle;
static SemaphoreHandle_t s_lvgl_mutex;
static TaskHandle_t s_lvgl_task_handle;

// LVGL is not thread-safe, so all LVGL object/timer calls share this mutex.
static void lvgl_lock(void)
{
  if (s_lvgl_mutex != NULL) {
    xSemaphoreTake(s_lvgl_mutex, portMAX_DELAY);
  }
}

static void lvgl_unlock(void)
{
  if (s_lvgl_mutex != NULL) {
    xSemaphoreGive(s_lvgl_mutex);
  }
}

// esp_lcd calls this after an asynchronous color transfer has finished.
static bool lcd_flush_ready_cb(esp_lcd_panel_io_handle_t panel_io,
                               esp_lcd_panel_io_event_data_t *edata,
                               void *user_ctx)
{
  (void)panel_io;
  (void)edata;

  lv_disp_drv_t *disp_drv = (lv_disp_drv_t *)user_ctx;
  lv_disp_flush_ready(disp_drv);

  return false;
}

static void lcd_flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map)
{
  esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t)drv->user_data;
  // LVGL uses inclusive coordinates; esp_lcd expects the end coordinate to be exclusive.
  int x_start = area->x1;
  int x_end = area->x2 + 1;
  int y_start = area->y1;
  int y_end = area->y2 + 1;

  esp_lcd_panel_draw_bitmap(panel_handle, x_start, y_start, x_end, y_end, color_map);
}

static void lvgl_tick_cb(void *arg)
{
  (void)arg;
  // Keep LVGL's internal time base moving independently of the main task.
  lv_tick_inc(2);
}

static void button_event_cb(lv_event_t *event)
{
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    ESP_LOGI(TAG, "LVGL button clicked");
  }
}

static void touch_read_cb(lv_indev_drv_t *drv, lv_indev_data_t *data)
{
  esp_lcd_touch_handle_t touch_handle = (esp_lcd_touch_handle_t)drv->user_data;
  uint16_t x[1];
  uint16_t y[1];
  uint16_t strength[1];
  uint8_t count = 0;

  data->state = LV_INDEV_STATE_REL;
  data->continue_reading = false;

  if (touch_handle == NULL || esp_lcd_touch_read_data(touch_handle) != ESP_OK) {
    return;
  }

  if (esp_lcd_touch_get_coordinates(touch_handle, x, y, strength, &count, 1) && count > 0) {
    data->point.x = x[0];
    data->point.y = y[0];
    data->state = LV_INDEV_STATE_PR;
  }
}

static void lvgl_task(void *arg)
{
  (void)arg;

  while (1) {
    lvgl_lock();
    uint32_t task_delay_ms = lv_timer_handler();
    lvgl_unlock();
    if (task_delay_ms > 20) {
      task_delay_ms = 20;
    }
    if (task_delay_ms < 5) {
      task_delay_ms = 5;
    }
    vTaskDelay(pdMS_TO_TICKS(task_delay_ms));
  }
}

static esp_err_t lcd_backlight_init(void)
{
  // Keep the backlight off until the panel is initialized to avoid visible noise.
  gpio_config_t bk_gpio_config = {
    .mode = GPIO_MODE_OUTPUT,
    .pin_bit_mask = 1ULL << LCD_PIN_NUM_BK_LIGHT,
  };
  ESP_RETURN_ON_ERROR(gpio_config(&bk_gpio_config), TAG, "configure backlight GPIO failed");
  ESP_RETURN_ON_ERROR(gpio_set_level(LCD_PIN_NUM_BK_LIGHT, LCD_BK_LIGHT_OFF_LEVEL),
                      TAG,
                      "turn backlight off failed");
  return ESP_OK;
}

static esp_err_t lcd_panel_init(void)
{
  // Configure SPI2 on ESP32-S3 native IO_MUX pins for the display bus.
  spi_bus_config_t bus_config = {
    .sclk_io_num = LCD_PIN_NUM_SCLK,
    .mosi_io_num = LCD_PIN_NUM_MOSI,
    .miso_io_num = LCD_PIN_NUM_MISO,
    .quadwp_io_num = GPIO_NUM_NC,
    .quadhd_io_num = GPIO_NUM_NC,
    .max_transfer_sz = LCD_H_RES * LCD_DRAW_BUF_LINES * sizeof(lv_color_t),
  };
  ESP_RETURN_ON_ERROR(spi_bus_initialize(LCD_SPI_HOST, &bus_config, SPI_DMA_CH_AUTO),
                      TAG,
                      "initialize SPI bus failed");

  // Panel IO translates esp_lcd commands and pixel transfers to SPI transactions.
  esp_lcd_panel_io_handle_t io_handle = NULL;
  esp_lcd_panel_io_spi_config_t io_config = {
    .dc_gpio_num = LCD_PIN_NUM_DC,
    .cs_gpio_num = LCD_PIN_NUM_CS,
    .pclk_hz = LCD_PIXEL_CLOCK_HZ,
    .lcd_cmd_bits = 8,
    .lcd_param_bits = 8,
    .spi_mode = 0,
    .trans_queue_depth = 10,
    .on_color_trans_done = lcd_flush_ready_cb,
    .user_ctx = &s_disp_drv,
  };
  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_SPI_HOST,
                                               &io_config,
                                               &io_handle),
                      TAG,
                      "create LCD panel IO failed");

  // Most 2.8 inch ILI9341 modules use BGR order; switch here if colors are wrong.
  esp_lcd_panel_dev_config_t panel_config = {
    .reset_gpio_num = LCD_PIN_NUM_RST,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
#else
    .color_space = ESP_LCD_COLOR_SPACE_BGR,
#endif
    .bits_per_pixel = 16,
  };
  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_ili9341(io_handle, &panel_config, &s_panel_handle),
                      TAG,
                      "create ILI9341 panel failed");

  ESP_RETURN_ON_ERROR(esp_lcd_panel_reset(s_panel_handle), TAG, "reset panel failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_init(s_panel_handle), TAG, "init panel failed");
  // Rotate the physical 240x320 panel into landscape 320x240.
  ESP_RETURN_ON_ERROR(esp_lcd_panel_swap_xy(s_panel_handle, LCD_SWAP_XY), TAG, "swap xy failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_mirror(s_panel_handle, LCD_MIRROR_X, LCD_MIRROR_Y),
                      TAG,
                      "mirror panel failed");
  ESP_RETURN_ON_ERROR(esp_lcd_panel_disp_on_off(s_panel_handle, true), TAG, "turn display on failed");
  ESP_RETURN_ON_ERROR(gpio_set_level(LCD_PIN_NUM_BK_LIGHT, LCD_BK_LIGHT_ON_LEVEL),
                      TAG,
                      "turn backlight on failed");

  return ESP_OK;
}

static esp_err_t touch_init(void)
{
  esp_lcd_panel_io_handle_t touch_io_handle = NULL;
  esp_lcd_panel_io_spi_config_t touch_io_config =
    ESP_LCD_TOUCH_IO_SPI_XPT2046_CONFIG(LCD_PIN_NUM_TOUCH_CS);

  ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_SPI_HOST,
                                               &touch_io_config,
                                               &touch_io_handle),
                      TAG,
                      "create touch panel IO failed");

  esp_lcd_touch_config_t touch_config = {
    .x_max = LCD_H_RES,
    .y_max = LCD_V_RES,
    .rst_gpio_num = GPIO_NUM_NC,
    .int_gpio_num = LCD_PIN_NUM_TOUCH_IRQ,
    .flags = {
      .swap_xy = LCD_SWAP_XY,
      .mirror_x = LCD_MIRROR_X,
      .mirror_y = LCD_MIRROR_Y,
    },
  };

  ESP_LOGI(TAG, "initialize XPT2046 touch controller");
  ESP_RETURN_ON_ERROR(esp_lcd_touch_new_spi_xpt2046(touch_io_handle,
                                                    &touch_config,
                                                    &s_touch_handle),
                      TAG,
                      "initialize XPT2046 failed");

  lv_indev_drv_init(&s_indev_drv);
  s_indev_drv.type = LV_INDEV_TYPE_POINTER;
  s_indev_drv.read_cb = touch_read_cb;
  s_indev_drv.user_data = s_touch_handle;
  lv_indev_drv_register(&s_indev_drv);

  return ESP_OK;
}

static esp_err_t lvgl_port_init(void)
{
  lv_init();

  s_lvgl_mutex = xSemaphoreCreateMutex();
  ESP_RETURN_ON_FALSE(s_lvgl_mutex, ESP_ERR_NO_MEM, TAG, "create LVGL mutex failed");

  // Two DMA-capable partial draw buffers let LVGL render while SPI sends pixels.
  size_t draw_buffer_size = LCD_H_RES * LCD_DRAW_BUF_LINES;
  lv_color_t *buf1 = heap_caps_malloc(draw_buffer_size * sizeof(lv_color_t),
                                      MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
  lv_color_t *buf2 = heap_caps_malloc(draw_buffer_size * sizeof(lv_color_t),
                                      MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
  ESP_RETURN_ON_FALSE(buf1 && buf2, ESP_ERR_NO_MEM, TAG, "allocate LVGL draw buffers failed");

  lv_disp_draw_buf_init(&s_disp_buf, buf1, buf2, draw_buffer_size);

  // Register this ILI9341 panel as LVGL's default display.
  lv_disp_drv_init(&s_disp_drv);
  s_disp_drv.hor_res = LCD_H_RES;
  s_disp_drv.ver_res = LCD_V_RES;
  s_disp_drv.flush_cb = lcd_flush_cb;
  s_disp_drv.draw_buf = &s_disp_buf;
  s_disp_drv.user_data = s_panel_handle;
  lv_disp_drv_register(&s_disp_drv);
  ESP_RETURN_ON_ERROR(touch_init(), TAG, "touch init failed");

  const esp_timer_create_args_t tick_timer_args = {
    .callback = lvgl_tick_cb,
    .name = "lvgl_tick",
  };
  esp_timer_handle_t tick_timer = NULL;
  ESP_RETURN_ON_ERROR(esp_timer_create(&tick_timer_args, &tick_timer), TAG, "create LVGL tick failed");
  ESP_RETURN_ON_ERROR(esp_timer_start_periodic(tick_timer, 2 * 1000), TAG, "start LVGL tick failed");

  // The LVGL task runs the timer handler; UI changes from other tasks must lock first.
  BaseType_t ret = xTaskCreate(lvgl_task, "lvgl", 8192, NULL, 5, &s_lvgl_task_handle);
  ESP_RETURN_ON_FALSE(ret == pdPASS, ESP_ERR_NO_MEM, TAG, "create LVGL task failed");

  return ESP_OK;
}

esp_err_t lcd_init(void)
{
  ESP_LOGI(TAG, "initialize ILI9341 on SPI2");
  ESP_RETURN_ON_ERROR(lcd_backlight_init(), TAG, "backlight init failed");
  ESP_RETURN_ON_ERROR(lcd_panel_init(), TAG, "panel init failed");
  ESP_RETURN_ON_ERROR(lvgl_port_init(), TAG, "LVGL init failed");

  lvgl_lock();
  lv_obj_set_style_bg_color(lv_scr_act(), lv_color_white(), 0);
  lv_obj_set_style_bg_opa(lv_scr_act(), LV_OPA_COVER, 0);
  s_text_label = lv_label_create(lv_scr_act());
  if (s_text_label == NULL) {
    ESP_LOGE(TAG, "create text label failed");
    lvgl_unlock();
    return ESP_ERR_NO_MEM;
  }
  lv_obj_set_style_bg_opa(s_text_label, LV_OPA_TRANSP, 0);
  lv_obj_set_style_text_font(s_text_label, &lv_font_chinese_16, 0);
  lv_obj_set_style_text_color(s_text_label, lv_color_black(), 0);
  lv_obj_set_style_text_opa(s_text_label, LV_OPA_COVER, 0);
  lv_label_set_long_mode(s_text_label, LV_LABEL_LONG_WRAP);
  lv_obj_set_width(s_text_label, LCD_H_RES - 20);
  lv_obj_set_style_text_align(s_text_label, LV_TEXT_ALIGN_CENTER, 0);
  lv_label_set_text(s_text_label, "");
  lv_obj_align(s_text_label, LV_ALIGN_CENTER, 0, 0);

  lv_obj_invalidate(lv_scr_act());
  lvgl_unlock();

  return ESP_OK;
}

void lcd_show_text(const char *text)
{
  lvgl_lock();
  if (s_text_label != NULL) {
    lv_label_set_text(s_text_label, text != NULL ? text : "");
    lv_obj_align(s_text_label, LV_ALIGN_CENTER, 0, -24);
  }
  if (s_button == NULL) {
    s_button = lv_btn_create(lv_scr_act());
    if (s_button != NULL) {
      lv_obj_set_size(s_button, 120, 42);
      lv_obj_add_event_cb(s_button, button_event_cb, LV_EVENT_CLICKED, NULL);

      lv_obj_t *button_label = lv_label_create(s_button);
      if (button_label != NULL) {
        lv_obj_set_style_text_font(button_label, &lv_font_chinese_16, 0);
        lv_label_set_text(button_label, "Click Me");
        lv_obj_center(button_label);
      }
    } else {
      ESP_LOGE(TAG, "create button failed");
    }
  }
  if (s_button != NULL && s_text_label != NULL) {
    lv_obj_align_to(s_button, s_text_label, LV_ALIGN_OUT_BOTTOM_MID, 0, 14);
  }
  lv_obj_invalidate(lv_scr_act());
  lv_timer_handler();
  lvgl_unlock();
}
